//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG
//
#include<iostream>
#include<cstdio>
#include<algorithm>
#define MAX_N 1000 + 10
#define INF 1E9

using namespace std;

int n, m;
int cnt[MAX_N];

void solve(){
    for(int i = 0; i < m; i++){
        int c;
        scanf("%d", &c);
        cnt[c - 1]++;
    }
    cout << *min_element(cnt, cnt + n) << endl;
}
int main(){
    cin >> n >> m;
    solve();
    return 0;
}